#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shapeshed/asimo/runs/run-VPTU3HD1ArN29SPW

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_route53_zone.shapeshed_com: Refreshing state... [id=Z0914809299OFXJQ90CQ9]
aws_route53_record.__26eca8f67eb273a9cafb25ef1989fdf1_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com_CNAME]
aws_route53_record.__8e912589f272071e6beb0f31146b9819_www_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9__8e912589f272071e6beb0f31146b9819.www.shapeshed.com_CNAME]
aws_route53_record.moxie_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_A]
aws_route53_record.shapeshed_com_NS: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_NS]
aws_route53_record.mx01_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_A]
aws_route53_record.smtp_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_smtp.shapeshed.com_CNAME]
aws_route53_record.mail_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mail.shapeshed.com_CNAME]
aws_route53_record.mx01_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_mx01.shapeshed.com_AAAA]
aws_route53_record.moxie_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_AAAA]
aws_route53_record.shgsbo4u9t_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shgsbo4u9t.shapeshed.com_CNAME]
aws_route53_record.d78e316caf6d1de59613b2e5a7e0d62b_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_d78e316caf6d1de59613b2e5a7e0d62b.shapeshed.com_CNAME]
aws_route53_record.w6yzyrt6eyqt_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_w6yzyrt6eyqt.shapeshed.com_CNAME]
aws_route53_record.__acme-challenge_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__acme-challenge.shapeshed.com_TXT]
aws_route53_record.shapeshed_com_MX: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_MX]
aws_route53_record.shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_TXT]
aws_route53_record.imap_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_imap.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_A]
aws_route53_record.moxie__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie._domainkey.shapeshed.com_TXT]
aws_route53_record.googlee87068e8125fba47_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_googlee87068e8125fba47.shapeshed.com_CNAME]
aws_route53_record.yandex-verification_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_yandex-verification.shapeshed.com_TXT]
aws_route53_record.shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_AAAA]
aws_route53_record.shapeshed_com_SOA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_SOA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.finney_shapeshed_com_A will be created
  + resource "aws_route53_record" "finney_shapeshed_com_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "finney.shapeshed.com"
      + records         = [
          + "45.79.87.169",
        ]
      + ttl             = 86400
      + type            = "A"
      + zone_id         = "Z0914809299OFXJQ90CQ9"
    }

  # aws_route53_record.finney_shapeshed_com_AAAA will be created
  + resource "aws_route53_record" "finney_shapeshed_com_AAAA" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "moxie.shapeshed.com"
      + records         = [
          + "2600:3c01::f03c:93ff:fe84:fa35",
        ]
      + ttl             = 86400
      + type            = "AAAA"
      + zone_id         = "Z0914809299OFXJQ90CQ9"
    }

  # aws_route53_record.mx02_shapeshed_com_A will be created
  + resource "aws_route53_record" "mx02_shapeshed_com_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mx02.shapeshed.com"
      + records         = [
          + "45.79.87.169",
        ]
      + ttl             = 86400
      + type            = "A"
      + zone_id         = "Z0914809299OFXJQ90CQ9"
    }

  # aws_route53_record.mx02_shapeshed_com_AAAA will be created
  + resource "aws_route53_record" "mx02_shapeshed_com_AAAA" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mx02.shapeshed.com"
      + records         = [
          + "2600:3c01::f03c:93ff:fe84:fa35",
        ]
      + ttl             = 86400
      + type            = "AAAA"
      + zone_id         = "Z0914809299OFXJQ90CQ9"
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @shapeshed, Action: `pull_request`*